Revit 2027 API
ParameterTypeId.ContinuousFootingLength Property
 "Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ContinuousFootingLength { get; }
Public Shared ReadOnly Property ContinuousFootingLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ContinuousFootingLength {
	ForgeTypeId^ get ();
}
static member ContinuousFootingLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace